static drift/FoilShipRound/T0.22_Fr0.2_alpha10.0/0.org/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
	version     2.0;
	format      ascii;
	class       pointVectorField;
	location    "0";
	object      pointDisplacement;
}

#include      "include/initialConditions";

dimensions    [0 1 0 0 0 0 0];

internalField uniform (0 0 0);

boundaryField
{
	#includeEtc	"caseDicts/setConstraintTypes"

	inlet
	{
		type	fixedValue;
		value	$internalField;
	}


	outlet
	{
		type	fixedValue;
		value	$internalField;
	}


	top
	{
		type	fixedValue;
		value	uniform (0 0 0);
	}


	hull
	{
		type	calculated;
	}


	deck
	{
		type	calculated;
	}


	trailingEdge
	{
		type	calculated;
	}

}
